In [9]:
import pandas as pd
import sqlite3

In [8]:
def dbConnection():
    return sqlite3.connect("example.db")

In [4]:
# Example of retrieving data from a sqlite database
with sqlite3.connect("example.db") as con:
    cur = con.execute("SELECT id, first_name, last_name FROM person")
    print(cur.fetchall())

[(1, 'Kyle', 'Johnsen'), (2, 'Giannis', 'Gallios')]

In [13]:
# Example using pandas for SQL
with dbConnection() as con:
    display(pd.read_sql("SELECT * FROM person",con))

   id first_name last_name
0   1       Kyle   Johnsen
1   2    Giannis   Gallios

In [16]:
# a more elaborate select example with filter
with dbConnection() as con:
    df = pd.read_sql("SELECT * FROM person WHERE first_name='Kyle' or id>1",con)
    display(df)

   id first_name last_name
0   1       Kyle   Johnsen
1   2    Giannis   Gallios

In [42]:
with dbConnection() as con:
    cur = con.execute("INSERT INTO  person (first_name,last_name) VALUES (?,?)", ('brook','Bower'))
    display(cur)

IntegrityError: NOT NULL constraint failed: person.id